aziobro/gps-base-station/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
# Board has ESP32-P4 silicon rev v1.3 (pre-v3.0 family — mutually exclusive with v3.x)
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
# WiFi — ESP32-P4 host + ESP32-C6 slave via esp_hosted over SDIO.
# P4-side SDIO pins: CLK=18 CMD=19 D0=14 D1=15 D2=16 D3=17, C6 RST=GPIO54.
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_ESP_HOSTED_SDIO_SLOT_1=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=20000
# Avoid an endless P4 reboot loop if the C6/SDIO link wedges after a soft OTA
# reboot. The transport still posts failure events; we keep the host alive long
# enough to preserve logs and touchscreen diagnostics.
# CONFIG_ESP_HOSTED_TRANSPORT_RESTART_ON_FAILURE is not set
# Deeper host->slave TX queue so packets ride out a busy C6 (longer SDIO write
# retry window) instead of being dropped at enqueue.
CONFIG_ESP_HOSTED_SDIO_TX_Q_SIZE=32
# Move SDIO DMA buffers to PSRAM — ESP32-P4 GDMA can reach PSRAM via cache.
# Without this, ~47KB of DMA-capable internal SRAM is consumed before the main
# task can be created, leaving insufficient space for the 10KB main task stack.
CONFIG_ESP_HOSTED_MEMPOOL_PREFER_SPIRAM=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
# PSRAM settings needed for MIPI DSI display frame buffer.
# USE_CAPS_ALLOC keeps malloc() in internal SRAM; PSRAM is only
# accessed explicitly via heap_caps_malloc(MALLOC_CAP_SPIRAM).
# This is required when esp_hosted SDIO runs alongside the display.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y
# LVGL FreeRTOS port (used by BSP display)
CONFIG_LV_OS_FREERTOS=y
# Route all LVGL allocations to PSRAM — the 64 KB built-in pool is too small
# for complex UI widgets (keyboard + modals + file browser).
CONFIG_LV_USE_CUSTOM_MALLOC=y
# Large numeric readout fonts for the marine-instrument UI (value/hero sizes).
# These cost flash .rodata only — NOT the scarce internal SRAM. 14 stays the default.
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_LWIP_MAX_SOCKETS=32
# Larger TCP window so the high-RTT SoftAP path (single-radio APSTA time-shares
# with the station, AP clients power-save between beacons) isn't throttled by a
# tiny window. Default 5760 (4xMSS) starves AP throughput; 11520 = 8xMSS.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=11520
CONFIG_LWIP_TCP_WND_DEFAULT=11520
# Selective ACK: recover individual segments lost on the SDIO link without a
# full timeout-based retransmit stall.
CONFIG_LWIP_TCP_SACK_OUT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
# Reliability over HTTPS throughput: hardware AES on the P4 needs DMA-capable
# alignment/descriptor buffers and can fail during SDIO WiFi + file-export load.
# Software AES avoids the "esp-aes: Failed to allocate memory" path.
# CONFIG_MBEDTLS_HARDWARE_AES is not set
# CONFIG_MBEDTLS_HARDWARE_GCM is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
